Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Разрешение",Элемент.ТекущаяСтрока);
	ОбновитьВПодчиненномДокументе(ПараметрыИзменения);
	
	Если ПараметрыИзменения.Свойство("Путевка") Тогда
		ОповеститьОбИзменении(ПараметрыИзменения.Путевка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВПодчиненномДокументе(ПараметрыИзменения)
	Разрешение = ПараметрыИзменения.Разрешение;
	Если ЗначениеЗаполнено(Разрешение) Тогда
		Если Разрешение.ПолучитьОбъект() = Неопределено Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Разрешение);	
	
	Если Путевка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Разрешение.ПометкаУдаления = Путевка.ПометкаУдаления Тогда
		Возврат;
	Иначе
		Попытка
			ПутевкаОбъект = Путевка.ПолучитьОбъект();
			ПутевкаОбъект.УстановитьПометкуУдаления(Разрешение.ПометкаУдаления);
		Исключение
			ТекстОшибки = ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки());
			ОбщегоНазначения.СформироватьЗаписьЖурналаРегистрации("Изменение пометки удаления",УровеньЖурналаРегистрации.Ошибка,Путевка.Метаданные(),Путевка,ТекстОшибки);		
		КонецПопытки;
		ПараметрыИзменения.Вставить("Путевка",ПутевкаОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОхотаСервер.УстановитьОтборДинамическогоСписка(Список);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УО = Список.УсловноеОформление.Элементы;
	
	ЭлементУО1 = УО.Добавить();
	ЭлементУО2 = УО.Добавить();
	ЭлементУО3 = УО.Добавить();

	ЭлементУО1.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЦветМорскойВолныНейтральный);
	ЭлементУО2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);
	ЭлементУО3.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ХакиТемный);

	
	ЭлементУсловия = ЭлементУО1.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сдан");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементУО2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БезПроверки");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементУО2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сдан");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	
	ЭлементУсловия = ЭлементУО3.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктМПР");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементУО2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктМПР");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;


КонецПроцедуры


&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("УдалениеРазрешения");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ПолучитьРеквизитДокумента(ВыбраннаяСтрока,"Сдан")Или ПолучитьРеквизитДокумента(ВыбраннаяСтрока,"АктМПР")  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ сдан. Редактирование запрещено!",ВыбраннаяСтрока);
		Если НЕ ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава() Тогда
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитДокумента(Документ,Реквизит)
	Возврат	Документ[Реквизит];
КонецФункции
